Repository: yedino/galaxy42
Catalog: src-misc/locale/galaxy42_installer/*.po
Languages: pl, ru, uk

source: This tool will configure your computer for the SELECTED by you functions of $programname.
pl: To narzędzie skonfiguruje Twój komputer dla WYBRANYCH przez Ciebie funkcji programu $programname
ru: Этот инструмент настроит Ваш компьютер для ВЫБРАННЫХ вами функций $programname.
uk: Цей інструмент налаштує ваш комп’ютер для ОБРАНИХ Вами функцій $programname.

source: This seems to be a text-mode GUI, you can use up/down arrows, SPACE to select option, ENTER to finish.
pl: Wygląda na to iż używasz tekstowego interfejsu, możesz używać strzałki w górę/w dół, SPACJI aby zaznaczyć opcję, ENTER aby zakończyć.
ru: Это похоже на текстовый режим графического интерфейса, вы можете использовать кнопки Вверх/Вниз, Пробел для выбора опции, ENTER для завершения.
uk: Це, здається, текстовий режим графичного інтерфейсу, Ви можете використовувати кнопки Вгору/Вниз, Пробіл щоб обрати опцію, ENTER щоб закінчити.

source: We recognize your system/platform as:
pl: Rozpoznajemy tą platformę jako:
ru: Мы распознали вашу систему/платформу как:
uk: Ми визначили вашу систему/платформу як:

source: Configure computer for $programname
pl: Skonfiguruj komputer dla $programname
ru: Настройка компьютер для $programname
uk: Налаштувати комп’ютер для $programname

source: Ok
ru: Ок
uk: Далі

source: Quit
pl: Zakończ
ru: Выход
uk: Вихід

source: How do you want to use $programname:
pl: Jak chcesz używać $programname:
ru: Как Вы хотите использовать $programname:
uk: Як Ви бажаєте використовувати $programname:?

# menu_task_warn
source: Show warnings
pl: (Pokaż ostrzeżenia podczas instalacji)
ru: Показывать предупреждения
uk: Показувати попередження

# menu_task_build
source: Build this program from source code
pl: Zbuduj ten program
ru: Собрать эту программу из исходного кода
uk: Побудувати цю программу з вихідного коду

# menu_task_touse
source: Use this program on this computer
pl: Używaj programu na tym komputerze
ru: Использовать эту программу на этом компьютере
uk: Використати цю программу на цьому комп’ютері

# menu_task_devel
source: Develop this program
pl: Rozwijaj ten program (n.p. jako programista)
ru: Разрабатывать эту программу
uk: Розробляти цю программу

# menu_task_bgitian
source: Compile and sign/publish (e.g. Gitian)
pl: Zbuduj oraz podpisz/opublikuj (Gitian)
ru: Компилировать и подписать/опубликовать (например, Gitian)
uk: Скомпілювати та підписати/опублікувати (наприклад Gitian)

source: Done
pl: Gotowe
ru: Сделано
uk: Готово

source: Finished installation of $programname.
pl: Ukończono instalcję $programname
ru: Закончена установка $programname.
uk: Інсталяція $programname завершена.

# warn2_net
source: WARNING: SPECIAL settings of networks - maybe names or functions of network cards (e.g. eth0/br0/lxcbr0) will be changed.
pl: UWAGA: SPECJALNE ustawienia sieci - może zostaną zmienione nazwy lub funkcje kart sieciowych (np eth0/br0/lxcbr0).
ru: ВНИМАНИЕ: СПЕЦИАЛЬНЫЕ настроки сетей - возможно имена или функции сетевых адаптеров (например, eth0/br0/lxcbr0) будут изменены.
uk: Попередження: СПЕЦІАЛЬНІ налаштування мереж - можливо, імена або функції мережевихадаптерів (наприклад eth0/br0/lxcbr0) буде змінено.

# warn2_net_title
source: WARNING (SPECIAL: networks)
pl: Uwaga (SPECJALNE: sieć)
ru: ВНИМАНИЕ (СПЕЦИАЛЬНЫЕ: сети)
uk: ПОПЕРЕДЖЕННЯ (SPECIAL: networks)

# warning_build
source: * Installing tools to build a source code
pl: * Instalacja narzędzi do budowy z kodu źródłowego
ru: * Установка инструментов для сборки исходного кода
uk: * Інсталювання інструментів для побудови вихідного коду

# warning_devel
source: * We're going to install some developer tools e.g. to simulate lot of networks on this computer (network namespace).
pl: * Zainstalujemy dodatkowe narzędzia deweloperskie, w tym do symulowania wielu osobnych sieci na tym komputerze (network namespace).
ru: * Мы собираемся установить специальные инструменты разработчика, например чтобы симулировать большое количество сетей на этом компьютере (network namespace).
uk: * Ми збираємося інсталювати деякі інструменти розробника. Наприклад, щоб зімітувати вілику кількистьмереж на цьому комп’ютері (network namespaces).

# warning_bgitian
source: * We're going to configure your computer to using Gitian (in virtualization LXC). Warning, it can make some others network cards and change settings actually using cards. For example other IP address from current main Internet link (e.g. eth0) can be showed/moved like attached to other card (that's how a 'bridge' works)
pl: * Skonfigurujemy komputer do używania Gitian (w lekkiej 'wirtualizacji' LXC). Uwaga, to może stworzyć jeszcze inne karty sieciowe, oraz zmienić ustawienia obecnych kart. Między innymi adres IP z obecnego głównego łącza do Internetu (np. eth0) może być pokazywany/przeniesiony jako przypisany do innej karty (tak działa 'bridge')
ru: * Мы собираемся настроить Ваш компьютер для использования Gitian (для виртуализации LXC). Внимание, это может создать несколько других сетевых адаптеров и изменить настройки существующих сетевых адаптеров. Для примера, IP-адрес с текущего основного Интернет адаптера (например, eth0) может быть показана/перемещена как присоединённая к другому адаптеру (вот как работает 'мост')
uk: * Ми збираємось налаштувати ваш комп’ютер для використання Gitian (у віртуалізації LXC). Попередження, це може створити декілько інших мережевих адаптерів і змінити налаштування адаптерів, що використовуються. Наприклад, IP-адреса з поточного основного інтернет адаптеру (наприклад eth0) може бути відображена/пересунута як прикріплена до іншого адаптеру (ось як працює 'міст')

# warning_SUMMARY
source: Please confirm undermentioned changes (they impact security).
pl: Proszę potwierdzić poniższe zmiany na komputerze (mają wpływ na bezpieczeństwo).
ru: Пожалуйста, подтвердите нижеперечисленные изменения (они влияют на безопасность).
uk: Будь ласка, підтвердіть нижчезазначені зміни (вони впливають на безпеку).

# warn_root
source: # We will need root (admin) rights during this installation.
pl: # Będziemy potrzebować praw root (admina) teraz przy instalacji.
ru: # Нам будут необходимы root-права (admin) в процессе установки.
uk: # Нам буде потрібен root (admin) дозвіл впродовж інсталяції.

# warn_fw
source: # Please remember to install NOW a firewall!
pl: # Proszę pamiętać o włączeniu TERAZ firewall (zapory sieciowej)!
ru: # Пожалуйста, не забудьте СЕЙЧАС установить брандмауэр!
uk: # Будь ласка, не забудьте інсталювати брандмауер!

# menu_task_verbose
source: (Show more details during installation)
pl: (Pokazuj więcej szczegółów podczas istalacji)
ru: (Показывать дополнительную информацию в процессе установки)
uk: (Показувати більше деталей під час інсталяції)

# install_progress_title
source: Progress of installation
pl: Postęp instalacji
ru: Прогресс установки
uk: Прогрес інсталювання

# warning_touse $programname
source: * Configure computer for running here the program $programname
pl: * Przygotowanie komputera do używania tutaj programu $programname.
ru: * Настроить компьютер для работы программы $programname
uk: * Налаштувати комп’ютер для роботи програми $programname

# status_done_step_BEFORE
source: Now we're doing:
pl: Teraz wykonamy etap instalacji:
ru: Сейчас мы делаем:
uk: Зараз ми робимо:

# status_done_step_PRESSKEY
source: Please press ENTER to continue...
pl: Proszę nacisnąć ENTER aby kontynuować...
ru: Пожалуйста, нажмите ENTER для продолжения...
uk: Будь ласка, натисніть ENTER для продовження...

# error_init_platforminfo
source: No information about this platform/system
pl: Nie udało się rozpoznać informacji o tym systemie operacyjnym/platformie które są tutaj używane.
ru: Нет информации об этой платформе/системе
uk: Відсутня інформація щодо цієї платформи/системи

# status_done_step $item
source: The step is done: '$item'.
pl: Wykonano etap instalacji: '$item'.
ru: Шаг готов: '$item'.
uk: Етап завершено: '$item'.

# menu_main_title $programname:
source: Installer $programname
pl: Instalator $programname.
ru: Установщик $programname
uk: Установник $programname

# menu_taskpack_normal_builduse
source: Simple: build this program to use it only here
pl: Proste: zbuduj ten program tylko aby go używać tutaj
ru: Простой: собрать эту программу, чтобы использовать её только тут
uk: Простий: побудувати цю программу для використання тільки на цьюму комп’ютері.

# menu_taskpack_custom
source: Chose the options...
pl: Wybierz dokładne opcje sam...
ru: Выберите вариант...
uk: Виберіть варіанти...

# menu_taskpack_quick_builduse
source: No confirmations (dangerous!) - build & use
pl: Bez pytań (niebezpieczne!) - zbuduj i używaj
ru: Без подтверждений (опасно!) - собрать и использовать
uk: Ніяких підтверджень (небезпечно!) - побудувати & використати

# menu_taskpack_quick_devel
source: No confirmations (dangerous!) - for developer
pl: Bez pytań (niebezpieczne!) - dla developera
ru: Без подтверждений (опасно!) - для разработчиков
uk: Ніяких підтверджень (небезпечно!) - для розробника

# tasks_we_will_do
source: We're going to do:
pl: Wykonamy teraz czynności:
ru: Мы собираемся сделать:
uk: Ми збираємось зробити:

# this_script_uses_sudo_flag $sudo_flag
source: Script isn't running like a root, but you put flagÂ $sudo_flag and we think so sudo is ready and we're continuing
pl: Skrypt nie jest uruchomiony jako użytkownik root, ale podałeś flagę $sudo_flag więc zakładamy iż sudo jest ustawione i kontynuujemy.
ru: Скрипт не запущен с root правами, но вы установили флаг $sudo_flag, поэтому мы думаем что sudo готово и продолжаем работу
uk: Скрипт не запущений із root дозвілом, але ви поставили прапор $sudo_flag то ж ми думаємо що sudo вже є і тому ми йдемо далі.

# this_script_must_be_run_as_root_or $sudo_flag
source: This script must be run as root, or else run it with flag $sudo_flag to use sudo
pl: Ten skrypt musi być uruchomiony z użytkownika root. (Lub zamiast tego, jeżeli obecny użytkownik ma ustawiony dostęp do sudo do wykonywania wszelkich komend, to możesz uruchomić ten skrypt z flagą $sudo_flag).
ru: Этот скрипт должен быть запущен с root правами или запущен с флагом $sudo_flag для использования sudo
uk: Цей скрипт повинен бути запущений із root дозвілом або потрібно запустити його з прапором $sudo_flag щоб використати sudo

# error_init_platforminfo_unknown
source: This platform/OS is unknown
pl: Nie udało się rozpoznać informacji o tym systemie operacyjnym/platformie które są tutaj używane.
ru: Эта платформа/ОС неизвестна
uk: Ця платворма/ОС невідома.

# install_packages_title
source: Packages to install
pl: Postęp instalacji
ru: Пакеты для установки
uk: Пакети для інсталяції

source: Install
pl: Zainstaluj
ru: Установка
uk: Інсталяція

# L_install_failed
source: Installation failed
pl: Błąd instalacji
ru: Установка не удалась
uk: Інсталяція не вдалася

# L_install_nothing_to_do
source: Nothing to install now
pl: Nie trzeba nic tutaj instalować
ru: Ничего нет для установки
uk: Нема нічого для інсталяції

# L_now_installing_gitian_lxc
source: Now we are installing LXC for Gitian
pl: Teraz instalujemy LXC for Gitiana
ru: Сейчас мы устанавливаем LXC для Gitian
uk: Зараз ми інсталюємо LXC для Gitian

# L_needrestart_summary_text
source: System restart might be needed for following reasons:
pl: Restart systemu może być potrzebny z następujących powodów:
ru: Может потребоваться перезагрузка системы из-за следующих причин:
uk: Може знадобитися перезавантаження системи з наступних причин:

# L_needrestart_summary_title
source: Restart needed
pl: Potrzebny restart
ru: Необходима перезагрузка системы
uk: Необхідно перезавантаження

# L_needrestart_LXC_maybe
source: # Perhaps (but hopefully not) - LXC network (needed to use Gitian) should work now, but in case of problems you might want to restart the system to be sure.
pl: # Być może (ale raczej nie) - Sieć LXC (potrzebna dla używnia Gitian) powinna już działać, ale w razie problemów można zrestartować system dla pewności.
ru: # Возможно (но надеемся, что нет) - сеть LXC (необходима для использования Gitian) должна работать сейчас, но из-за возможных проблем Вам будет лучше перезагрузить систему, чтобы всё было хорошо.
uk: # Можливо (але сподіваємося що ні) - LXC мережа (необхідна для використання Gitian) повинна працювати зараз, але в разі будь яких проблем Вам може знадобитися перезавантаження системи, щоб бути впевненим.

# L_program_is_pre_pre_alpha
source: This program is not yet ready nor secure, do not use it in this version. (Please use it only on a test virtual machine).
ru: Эта программа ещё не готова и не безопасна. Пожалуйста, не используйте эту версию. (Пожалуйста, используйте её только на тестовой виртуальной машине).

# Can not find script library $lib (dir_base_of_source=$dir_base_of_source).
source: Can not find script library $lib (in directory $dir_base_of_source).
pl: Nie można znaleźć biblioteki $lib (w katalogu $dir_base_of_source).
ru: Не можем найти скрипт библиотеки $lib (в директории $dir_base_of_source).
uk: Не можу знайти скрипт бібліотеці library $lib (у директорії $dir_base_of_source).

source: We will install packages: $packages_str now (as root)
pl: Zainstalujemy pakiety: $packages_str (jako root)
ru: Мы установим пакеты: $packages_str сейчас (как root)
uk: Ми проінсталюємо пакети: $packages_str зараз (як root)

# L_install_packages_text $packages_str
source: We will install packages: $packages_str
pl: Zainstalujemy pakiety: $packages_str
ru: Мы установик пакеты: $packages_str
uk: Ми проінсталюємо пакети: $packages_str

# menu_taskpack_devel_builduse
source: Advanced: build program in Gitian / develop it
pl: Zaawansowane: zbuduj program w Gitian / rozwijaj go
ru: Продвинутое: собрать программу в Gitian / разрабатывать её
uk: Просунутий: побудувати програму в Gitian / розробляти її

# install_progress_fix
source: Automated fix of a problem
pl: Automatyczna naprawa problemu
ru: Автоматически решить проблему
uk: Автоматичне вирішення проблем

# L_fix_cgroupfs_mount
source: This system seems to not properly support cgroupfs. We will try to fix this. (This is needed to use Gitian).
pl: Ten system zdaje się nie obsługiwać poprawnie cgroupfs. Postaramy się to poprawic. (Jest to potrzebne do używania Gitian).
ru: Похоже, что эта система не поддерживает должным образом cgroupfs. Мы попытаемся исправить это. (Это необходимо чтобы использовать Gitian).
uk: Здається, що ця система не підтримує належним чином cgroupfs. Ми постараємося виправити це. (Це потрібно щоб вікористовувати Gitian).

# L_fix_ubuntu_old_build
source: This system (older version of Ubuntu) needs special settings for compilation. We will try to fix this. (This is needed to compile native programs on this machine).
pl: Ten system (starsza wersja Ubuntu) potrzebuje specjalnych ustawień do kompilacji. Postaramy się to poprawić. (Jest to potrzebne do kompilowania kodu na tej maszynie natywnie).
ru: Эта система (старая версия Ubuntu) требует специальные настройки для компиляции. Мы попробуем исправить это. (Это необходимо для нативной компиляции программы на этом компьютере).
uk: Ця система (застаріла версія Ubuntu) вимагає спеціальних налаштувань для компіляції. Ми постараємося виправити це. (Це потрібно для компіляції натівної програми на цьому комп’ютері).

# L_what_now
source: To normally compile the program nativly (and use it later) we recommend command: ./do And for Gitian build (for this or other system) we recommend: ./build-gitian You can change install options by running ./install.sh. List of other options you will see by running ./menu or by reading documentation.
pl: Aby normalnie skompilować program natywnie (i go potem używać) polecamy polecenie: ./do A do budowy w Gitian (na ten system lub inne systemy) polecamy: ./build-gitian Możesz zmienić opcje instalacji uruchamiając ./install.sh. Spis pozostałych możliwości zobaczysz uruchamiając ./menu lub czytając dokumentację.
ru: Для обычной компиляции программы нативно (и последующего использования) мы рекоммендуем команду: ./do И для сборки с помощью Gitian (для этой или других систем) мы рекоммендуем: ./build-gitian Вы можете поменять параметры инсталятора запустив ./install.sh. Список других опций вы можете увидеть запустив ./menu или прочитав документацию.
uk: Для звичайної компіляції програми натівно (та подальшого використування) ми рекомендуємо команду: ./do Для будування за допомогої Gitian (для цієї або інших ОС) ми рекомендуємо: ./build-gitian Ви можете змінити параметри інсталятора запустивши ./install.sh. Список інших опцій ви можете побачити запустивши ./menu або прочитавши документацію.

# L_fix_uninstall_apt_cacher bad=$apt_cacher_bad good=$apt_cacher_good.
source: We must now uninstall you other apt cacher program: [$apt_cacher_bad], so that we can instead install another one that we need: [$apt_cacher_good].
pl: Musimy teraz odinstalować Twój inny program apt cacher [$apt_cacher_bad], tak żebyśmy mogli zamiast niego zainstalować wymagany przez nas inny program: [$apt_cacher_good].
ru: Мы должны удалить вашу apt cacher программу: [$apt_cacher_bad], так чтобы взамен мы установили другую нужную нам: [$apt_cacher_good].
uk: Ми повинні видалити вашу apt cacher програму: [$apt_cacher_bad], щоб ми змогли взамін інсталювати потрібну нам : [$apt_cacher_good].

# warning_SUMMARY_TITLE
source: Caution safety and summary
pl: Ostrzeżenie bezpieczeństwa i podsumowanie
