Repository: yedino/galaxy42
Catalog: src-misc/locale/galaxy42_main/*.po
Languages: pl, ru, uk

# L_program_is_pre_pre_alpha
source: This program is not yet ready nor secure, do not use it in this version. (Please use it only on a test virtual machine).
pl: Ten program nie jest jeszcze gotowy, ani nie jest bezpieczny, proszę go nie używać w tej wersji.(Proszę używać go jedynie w testowej maszynie wirtualnej)
ru: Эта программа ещё не готова и не безопасна. Не используйте её в этой версии.(Пожалуйста, используйте её только для тестов и на виртуальной машине).
uk: Ця програма ще не готова та небезпечна! Не використовуйте цю версію програми. (Будь ласка, використовуйте цї тільки на тестовій віртуальній машині).

# L_program_is_copyrighted
source: This program is Copyrighted, see LICENCE.txt
pl: Ten program podlega ochronie tzw. praw autorskich, zobacz plik z licencą LICENCE.txt
ru: Данная программа защищена авторским правом, см. LICENCE.txt
uk: Ця програма захищена авторським правом, дивиться LICENCE.txt

# L_your_haship_address
source: Your hash-IPv6 address is :
pl: Twój adres hash-IPv6 :
ru: Ваш хэш-IPv6 адрес :
uk: Ваша хеш-IPv6 адреса :

# L_no_other_computer_Option_for_other
source: You are not connecting to anyone, so you should run on the other computer this program, with following options:
pl: Nie jesteś z nikim połączony, powinienieś uruchomić ten program na innym komputerze z opcjami:
ru: Вы ни к кому не подключились, так что Вам стоит запустить эту программу на другом компьютере со следующими параметрами:
uk: Ви не підключаєтесь до будь-кого, так що ви повинні запустити цю программу на іншому комп’ютері з наступними опціями:

# L_wait_for_connect
source: Now will wait for someone to connect to us...
pl: Teraz czekamy aż ktoś się do nas połączy...
ru: Теперь остаётся только ждать, чтобы кто-то к Вам подключился...
uk: Зараз будемо чека поки хто небудь підключиться до нас...

# L_starting_TUN
source: Starting the TUN router
pl: Uruchamiamy urządzenie TUN (wirtualna karta sieciowa)
ru: Запускает TUN маршрутизатор
uk: Стартуємо TUN маршрутизатор

# L_options
source: Options
pl: Opcje
ru: Параметры
uk: Параметри

# L_what_help_do
source: Print help messages, including program version and compiled options (what is enabled)
pl: Wypisuje pomocne wiadomości, łącznie z wersją programu i opcjami kompilacji (co jest włączone)
ru: Распечатайте вспомагательные сообщения, включая версию программы и параметры компиляции (что включено)
uk: Друкувати інформаційні повідомленні, включно версію програми та параметри компіляції (що було включено)

# L_what_h_do
source: same as --help
pl: To samo co --history
ru: тоже что и --help
uk: так само, як --help

# L_what_debug_do
source: Turns on more debug
pl: Włącza więcej debugów
ru: Включите для лучшей отладки
uk: Включає більше налагодження

# L_what_d_do
source: same as --debug
pl: To samo co --debug
ru: тоже что и --debug
uk: так само, як --debug

# L_what_quiet_do
source: Turns off most of the debug
pl: Wyłąccza większość debugów
ru: Выключает большую часть функций отладки

# L_what_q_do
source: same as --quiet
pl: To samo co --quiet
ru: тоже что и --quiet
uk: так само, як --quiet

# L_what_peer_do
source: Adding entire peer reference, in syntax like ip-pub. Can be give more then once, for multiple peers.
pl: Dodaje całą ścieżkę peera, w składni ip-pub. Może być podany więcej niż raz, dla wielu peerów
ru: Добавление ссылки для пира в виде 'ip-pub'. Может быть более одного, для нескольких пиров.
uk: Додавання стандартних пірів, із синтаксисом у вігляді ip-pub. Может бути більше одного, для багатьох пірів.

# L_what_info_do
source: COMMAND: Print info about key specified in my-key option requires [--my-key]
pl: POLECENIE: Wyświetla informację o kluczu określonym w opcji my-key Wymaga [--my-key]
ru: КОМАНДА: Показывает информацию о ключе, указанном в параметре 'my-key' требует ключ [--my-key]
uk: КОМАНДА: Друкує інформацію щодо ключа, який був зазначений у параметрі 'my-key' потребує [--my-key]

# L_what_listMyKeys_do
source: COMMAND: List your key which are in default location
pl: POLECENIE: Wyświetla Twoje klucze, które są w domyślnej lokalizacji
ru: КОМАНДА: Список ключей, которые находится месте по-умолчанию
uk: КОМАНДА: Перелік ключів, які знаходяться в місті за замовчуванням

# L_what_myKey_do
source: Choose already generated key from default location
pl: Wybiera już wygenerowany klucz z domyślnej lokalizacji
ru: Выбрать уже сгенерированный ключ из папки по-умолчанию
uk: Оберіть вже згенерований ключ з місця за азмовчуванням

# L_what_myKeyFile_do
source: Choose key file from specified location
pl: Wybiera plik z kluczem z określonej lokalizacji
ru: Выбрать файл ключа из указанного места
uk: Оберить файл ключу із зазначеного місця

# L_what_config_do
source: Load configuration file (for advanced users)
pl: Wczytuje plik konfiguracyjny (dla zaawansowanych użytkowników)
ru: Загрузить конфигурационный файл (для продвинутых пользователей)
uk: Завантажте конфігураційний файл (для просунутих користувачів)

# L_what_noConfig_do
source: Don't load any configuration file
pl: Uniemożliwia ładowanie pliku konfiguracyjnego
ru: Не загружать никаких конфигурационных файлов
uk: Не завантажуйте будь-який конфігураційний файл

# L_what_genKeySimple_do
source: COMMAND: Generate the recommended simple key (that gives you ownership of a new hash-IP address)
pl: POLECENIE: Generuje prosty zalecany klucz (przydzela Ci nowy, własny adres hash-ip)
ru: КОМАНДА: Сгенерировать рекоммендованный простой ключ (даёт право собственности на новый хэш-IP адрес)
uk: КОМАНДА: Генерує рекомендований простий ключ (який дає вам пласо власності на нову хеш-IP адресу)

# L_option_error
source: Error in options:
pl: Błąd w opcjach:
ru: Ошибка в параметрах:
uk: Помилка в налаштуваннях:

# L_warning_work_in_progres
source: *** WARNING: This is a work in progress, do NOT use this code, it has bugs, vulns, and 'typpos' everywhere! ***
pl: *** UWAGA: Wersja robocza programu! Nie używaj tego kodu, zawiera błędy i 'literówkii'. ***
ru: *** ВНИМАНИЕ: Разработка по прежнему продолжается, НЕ используйте этот код, он содержит ошибки, уязвимости и 'очепятки' повсюду! ***
uk: *** УВАГА: Робота над цією програмою ще триває, не використовуйте цій код, він має помилки, уразливості та 'одррукі' скрізь! ***

# L_wrong_peer_typo
source: Can not use the peers that you specified on the command line. Perhaps you have a typo in there.
pl: Nie można użyć peera określonego w lini komend. Prawdopodobnie masz tam literówkę.
ru: Не можем использовать пиры, которые были указаны в командной строке. Возможно у Вас там опечатка.
uk: Не можемо використовувати піри, які були вказані у КОМАНДНОМУ рядку. Можливо Ви зробили одрук.

# L_exit_from_connection_attempt
source: Program will now exit because of above reason.
pl: Program wyłączy się z powodu podanego powyżej
ru: Программа завершит свою работу по указанной выше причине.
uk: Програма буде завершена з-за вищевказаної причини.

# L_exit_from_connect
source: Exiting program now, as explained above...
pl: Zamykanie programu, wyjaśnione powyżej...
ru: Завершение программы, как было указано выше...
uk: Завершаемо зараз програму, як було пояснено вище...

# L_bad_peer_format
source: Bad peer format
pl: Zły format peera
ru: Неправильный формат пира
uk: Поганий формат піру

# L_bad_format_of_input_ip_address
source: bad format of input ip address
pl: zły format wejściowego adresu ip
ru: Неправильный формат вводимого ip-адреса
uk: поганий формат введеної ip-адреси

# L_failed_adding_peer_simple_reference
source: Adding peer from simple reference failed (exception):
pl: Dodawanie peera poprzez proste odniesienie nie powiodło się (wyjątek):
ru: Добавление пира из простой ссылки не удалось (исключение):
uk: Додавання піру з простого референса не вдалося (вилучення):

# L_program_build_options
source: Program build options:
pl: Opcje budowy programu:
ru: Параметры сборки программы:
uk: Налаштування сборки програми:

# L_CL_normal_code
source: Code level: normal code:
pl: Poziom bezpieczeństwa kodu: normalny kod
ru: Версия кода: нормальный:
uk: Рівень коду: звичайний:

# L_CL_previwew_code_
source: Code level: preview code:
pl: Poziom bezpieczeństwa kodu: najnowsza wersja kodu
ru: Версия кода: предварительный:
uk: Рівень коду: попередній перегляд:

# L_CL_experimental_code
source: Code level: experimental code:
pl: Poziom bezpieczeństwa kodu: eksperymentalny kod
ru: Версия кода: экспериментальный:
uk: Рівень коду: експериментальний:

# L_CL_experimental_dangerous_code
source: Code level: experimental dangerous code:
pl: Poziom bezpieczeństwa kodu: eksperymentalny niebezpieczny kod
ru: Версия кода: экспериментальный и небезопасный:
uk: Рівень коду: експериментальний та небезпечний:

# L_enabled_features
source: Enabled features:
pl: Włączone funkcje:
ru: Включены функции:
uk: Ввімкнені функції:

# L_info_require_myKey
source: --my-key is required for --info
pl: --my-key jest wymagane do --info
ru: --my-key необходим для --info
uk: --my-key потрібно для --info

# L_setIDI_require_myKey
source: --my-key is required for --set-IDI
pl: --my-key jest wymagane do --set-IDI
ru: --my-key необходим для --set-IDI
uk: --my-key потрібно для --set-IDI

# L_IDI_not_set_err
source: IDI is not set!
pl: IDI nie jest ustawione!
ru: IDI не указан!
uk: IDI не зазначена!

# L_your_key_list
source: Your key list:
pl: Lista Twoich kluczy:
ru: Список Ваших ключей:
uk: Перелік ваших ключей:

# L_generatin_new_keys
source: Generating your new keys.
pl: Generowanie nowych kluczy.
ru: Генерирование Ваших новых ключей.
uk: Генеруємо Ваші нові ключі.

# L_fail_file_overwrite
source: : file existing, it can't be overwrite [overwrite=
pl: : plik istnieje, nie może być nadpisany [overwrite=
ru: : файл существует, он не может быть перезаписан [перезапись=
uk: : файл існує та його не можна перезаписати [перезаписати=

# L_do_you_want
source: Do you want:
pl: Czy chcesz:
ru: Вы хотите:
uk: Ви бажаєте:

# L_Y_N
source: -- (YES/no)
pl: -- (TAK/nie), wpisz YES albo no:
ru: -- (ДА/нет)
uk: -- (Так/ні)

# L_error_during_action
source: Error occured during
pl: Wystąpił błąd podczas
ru: Ошибка возникла во время
uk: Помилка сталася під час

# L_exception_during_action
source: Exception caught: during_action=[
pl: Wystapił wyjątek, during_action=[
ru: Исключение поймано: во_время=[
uk: Виключення спіймано: під_час_дії=[

# L_what_exception
source: ], what=
pl: ], jaki=
ru: ], что=
uk: ], що=

# L_no_additional_info_exception
source: (No additional information about this exception, it was empty)
pl: (Brak dodatkowych informacji na temat tego wyjątku, był pusty
ru: (Нет дополнительной информации об этом исключении, оно было пустым)
uk: (Немає додаткової інформації щодо цього виключення, воно було порожне)

# L_exception
source: Exception:
pl: Wyjątek:
ru: Исключение:
uk: Виключення:

# L_unknown_exception
source: (Type of exception is unknown)
pl: (Typ wyjątku jest nieznany)
ru: (Тип исключения неизвестен)
uk: (Тип виключення невідомий)

# L_exit_aplication
source: , application will now exit
pl: , aplikacja wyłączy sie.
ru: , приложение будет сейчас закрыто
uk: , програма буде вимкнена

# L_all_preparations_done
source: Done all preparations, moving to the server main
pl: ukończono przygotowania, przenoszenie do głównego serwera
ru: Сделаны все приготовления, переходим к основной части
uk: Зробили всі підготовчі роботи, переходимо до головного серверу

# L_exiting_explained_above
source: Exiting as explained above
pl: Wyjście, jak wyjaśniono powyżej
ru: Выходим как было объяснено выше
uk: Вимикаємо як було пояснено вище

# L_unhandled_exception_running_server
source: Unhandled Exception reached the top of main (While running server):
pl: Wystąpił błąd (Unhandled Exception reached the top of main (While running server))
ru: Необработанное Исключение достигло вершины main (Пока был запущен сервер):
uk: Необроблене виключення досягло вершини (Під час праці серверу):

# L_unknown_exception_running_server
source: Unknown exception while running server.
pl: Nieznany wyjątek podczas pracy serwera
ru: Неизвестное исключение пока работал сервер.
uk: Невідоме виключення під час праці серверу.

# L_exit_no_error
source: Program exits (no error code)
pl: Program wyłączy się (brak kodu błędu)
ru: Программа завершает работу (без кода ошибки)
uk: Програма вимикається (немає кода помилки)

# L_running_devel_as_node_nr
source: Running in developer mode - as node_nr
pl: Uruchamianie w trybie developera, node_nr=
ru: Работает в режиме разработчика - как node_nr
uk: Працює в режимі розробника - як node_nr

# L_devel_adding_peer_with_args
source: Developer: adding peer with arguments:
pl: Developer: dodawaniepeerów z argumentami:
ru: Разработчик: добавление пира с параметрами:
uk: Розробник: додаємо пір з аргументами:

# L_devel_mode_as_nr
source: Running in developer mode - as my_nr=
pl: Uruchamianie w trybie developera, my_nr=
ru: Работает в режиме разработчика - как my_nr=
uk: Працює в режимі розробника - як my_nr=

# L_faliture_parsing_demo_usr_conf_file
source: Failure in parsing demo user config file (
pl: Błąd w składni próbnego pliku konfiguracyjnego użytkownika (
ru: Ошибка при загрузке демонстрационного конфигурационого файла пользователя (
uk: Помилка в завантажені демонстраційного конфигураційного файла користувача (

# L_loaded_demo_usr_conf_file
source: Loaded demo user config file (
pl: Ładuję próbny plik konfiguracyjny użytkownika (
ru: Загружен демонстрационный конфигурационный файл пользователя (
uk: Завантажен демонстраційний конфігураційний файл користувача (

# L_with_demo_options
source: ) with demo option:
pl: ) z próbnymi opcjami:
ru: ) с демонстрационными параметрами:
uk: ) із демонстраційними налаштуваннями:

# L_not_load_demo_usr_conf_file
source: Not loading demo user config file (
pl: Nie ładuję próbnego pliku konfiguracyjnego użytkownika (
ru: Не загружен демонстрационный конфигурационный файл пользователя (
uk: Не завантажен демонстраційний конфігураційний файл користувача (

# L_devel_demo_running_mode
source: Running in developer/demo mode.
pl: Uruchamianie w trybie developer/demo.
ru: Работает в режиме разработчика/демонстрации.
uk: Працює в режимі розробника/демонстраційному.

# L_unhandled_exception_devel_mode
source: There is a problem (Unhandled Exception reached the top of main (in DEVELOPER MODE):
pl: Wystąpił błąd (Unhandled Exception reached the top of main (in DEVEL MODE)):
ru: Обнаружена проблема (Необработанное Исключение достигло вершины main (в РЕЖИМЕ РАЗРАБОТЧИКА):
uk: Є проблема (Необроблене виключення досягло вершини (у РЕЖИМІ РОЗРОБНИКА):

# L_program_option_added
source: program options: added to option '
pl: opcje programu: dodano do opcji '
ru: параметры программы: добавлено к параметрам '
uk: налаштування програми: додати до налаштування '

# L_connect_into_demo_peer_nr
source: I connect into demo peer number:
pl: Łączę się z próbnym numerem peera
ru: Я присоединился к демонстрационному пиру под номером:
uk: Я підключився до піру нумер:

# L_remember_set_proper_home
source: Remember to set proper HOME with your key pair!
pl: Pamiętaj, aby ustawić odpowiedni HOME dla Twojej pary kluczy
ru: Не забудьте установить правильный параметр HOME с вашей парой ключей!
uk: Не забудьте встановити правильний параметр HOME із парою ключів!

# L_early_debug_comand_line
source: Early debug because command line options
pl: Wczesne debugowanie z powodu wiersza lini poleceń
ru: Ранняя отладка благодаря параметрам командной строки
uk: Дострокове налагодження завдяки налаштуванням із КОМАНДНОЙ стрічки

# L_starting_lib_libsodium
source: Starting library libsodium
pl: Uruchamiam bibliotekę libsodium
ru: Запускаем библиотеку libsodium
uk: Запускаємо бібліотеку libsodium

# L_libsodium_ready
source: Done, libsodium ready
pl: Skończone, libsodium jest gotowe
ru: Сделано, libsodium готова
uk: Гаразд, libsodium готова

# L_lisodium_init_err
source: libsodium init error!
pl: błąd uruchomienia libsodium!
ru: Ошибка при инициализации libsodium!
uk: Помилка у ініціалізації libsodium!

# L_parse_program_option
source: Will parse program options
pl: Analiza opcji programu
ru: Будут загружены параметры программы
uk: Знайдені налаштування програми

# L_what_demo_do
source: COMMAND: Try DEMO here. Run one of the compiled-in demonstrations of how program works. Use --demo help to see list of demos [TODO].
pl: POLECENIE: Wypróbuj DEMO. Uruchom jeden z wkompilowanych pokazów jak działa program Użyj --demo help aby zobaczyć listę DEMO [TODO]
ru: Команда: Попробуйте ДЕМОНСТРАЦИЮ здесь. Запустите одну из скомпилированных программ в демонстрационном режиме, чтобы посмотреть как работает программа. Используйте --demo справку для просмотра списка демонстраций [TODO].
uk: КОМАНДА: Спробуйте ДЕМОНСТРАЦІЮ тут. Виконайте одну з скомпільованих демонстрацій щод побачити як працює програма. Використайте --demo довідку, щоб побачити перелік демонстрацій [TODO].

# L_what_devel_do
source: COMMAND: Test: used by developer to run current test
pl: POLECENIE: Test: używana przez programistę, aby uruchomić aktualny test
ru: КОМАНДА: Тест: используется разработчиком для запуска текущего теста
uk: КОМАНДА: Тест: використовується розробником для запуску поточного тесту

# L_what_decelnum_do
source: Test: used by developer to set current node number (makes sense with option --devel)
pl: Test: używany przez programistę, aby ustawić bieżący numer węzła (ma sens z opcją --devel)
ru: Тест: используется разработчиков для установки номера текущего узла (имеет смысл с параметром --devel)
uk: Тест: використовуєтсья розробником для встановлення число вузлів (має сенс з налаштуваннях --devel)

# L_what_develdemo_do
source: COMMAND: Test: used by developer to set current demo-test number/name(makes sense with option --devel)
pl: POLECENIE: Test: używany przez programistę, aby ustawić aktualny demo-test, numer/nazwę (ma sens z opcją --devel)
ru: Команда: Тест: используется разработчиком для установки текущей демонстрации - тестового номера/имени (имеет смысл с параметром --devel)
uk: КОМАНДА: Тест: використовується розробником для встановлення поточного номеру демонстраційного тесту/ім’я(має сенс з налаштуванням --devel)

# L_what_myname_do
source: A readable name of your node (e.g. for debug)
pl: Czytelna nazwa węzła (np do debugowania)
ru: Удобочитаемое имя вашего узла (например, для отладки)
uk: Зручне ім’я для вашого вузла (наприглад, для налагодження)

# L_what_gen_config_do
source: COMMAND: Generate default .conf files: -galaxy.conf -connect_from.my.conf -connect_to.my.conf -connect_to.seed.conf *** this could overwrite your actual configurations ***
pl: POLECENIE: Generowanie domyślnych plików .conf: -galaxy.conf -connect_from.my.conf -connect_to.my.conf -connect_to.seed.conf *** może nadpisać Twoje konfiguracje ***
ru: Команда: Генерирует стандартные .conf файлы: -galaxy.conf -connect_from.my.conf -connect_to.my.conf -connect_to.seed.conf *** Это может перезаписать ваши актуальные настройки ***
uk: КОМАНДА: Генерує .conf файли із замовченням: -galaxy.conf -connect_from.my.conf -connect_to.my.conf -connect_to.seed.conf *** це може перезаписати Ваші фактичні конфігурації ***

# L_what_set_IDI_do
source: COMMAND: Set main instalation key (IDI) that will be use for signing connection (IDC) key requires [--my-key]
pl: POLECENIE: Ustawia główny klucz instalacji (IDI), który będzie użyty do podpisywania klucza (IDI) połączenia
ru: Команда: Устанавливает главный установочный ключ (IDI), который будет использоваться для подписи соединения (IDC) требует [--my-key]
uk: КОМАНДА: Встановлює головний ключ інсталяції (IDI) який буде використовуватися для підпису підключеня (IDC) потребує [--my-key]

# L_what_sing_do
source: COMMAND: Sign key or other message with your key requires [--my-key, --my-key-file and sign-key sign-key-file examples: --sign --my-key "myself" --sign-key "friend" --sign --my-key-file "/mount/usb2/work/work2" --sign-data-file "/mount/usb1/friend.public"
pl: POLECENIE: Podpisz klucz lub inną wiadomość swoim kluczem wymaga [--my-key, --my-key-file i sign-key sign-key-file przykłady: --sign --my-key "mój klucz" --sign-key "klucz drugiego urzytkownika" --sign --my-key-file "/mount/usb2/work/work2" --sign-data-file "/mount/usb1/friend.public"
ru: Команда: Подписывает ключ или любое сообщение с вашим ключом требует [--my-key, --my-key-file и sign-key sign-key-file примеры: --sign --my-key "myself" --sign-key "friend" --sign --my-key-file "/mount/usb2/work/work2" --sign-data-file "/mount/usb1/friend.public"
uk: КОМАНДА: Підписує ключ або інше повідомлення з вашим ключем потребує [--my-key, --my-key-file та sign-key sign-key-file наприклад: --sign --my-key "myself" --sign-key "friend" --sign --my-key-file "/mount/usb2/work/work2" --sign-data-file "/mount/usb1/friend.public"

# L_what_singKey_do
source: Name of key file in default location for keys
pl: Nazwa pliku klucza w domyślnej lokalizacji dla kluczy
ru: Имя ключа в месте по-умолчанию для ключей
uk: Ім’я файлу ключа у місці за замовченням

# L_what_singDataFile_do
source: Name of key file in specified location
pl: Nazwa pliku klucza w podanej lokalizacji na klucze
ru: Имя для ключа в указанном месте
uk: Ім’я файлу ключа у вказанному місці

# L_what_singKeyFile_do
source: Name of data file in specified location
pl: Nazwa pliku danych w określonej lokalizacji
ru: Имя файла данных в указанном месте
uk: Ім’я файлу даних у вказанному місці

# L_what_verify_do
source: COMMAND: Verify key or data with trusted-key and key or data requires [--trusted-key or --trusted-key-file and --toverify-key or --toverify-key-file or --toverify-data-file *--signature-file] Default signature file name = key/data file name + ".sig" extension in same location as key/data file
pl: POLECENIE: Zweryfikuje klucz lub plik zaufanym kluczem i kluczem lub danymi wymaga [--trusted-key albo --trusted-key-file i --toverify-key albo --toverify-key-file albo --toverify-data-file *--signature-file] Domyślna nazwa pliku podpisu= nazwa pliku/klucza + ".sig" rozszerzenie w tej samej lokalizacji co klucze/pliki
ru: КОМАНДА: Верифицирует ключ или данные с доверенным ключом и ключ или данные требует [--trusted-key или --trusted-key-file и --toverify-key или --toverify-key-file или --toverify-data-file *--signature-file] По-умолчанию сигнатура имени файла = key/data file name + ".sig" расширение в том же месте, что и ключ/данные файл
uk: КОМАНДА: Веріфікує ключ або дані з довіреним ключем та ключем або дані потребує [--trusted-key або --trusted-key-file та --toverify-key або --toverify-key-file або --toverify-data-file *--signature-file] Сігнатура імені файлу за замовчуванням = ключ/ім’я файлу даних + ".sig" розширення у тому самому місці як ключ/файл даниї

# L_what_trustedKey_do
source: Name of trusted key in default location
pl: Nazwy zaufanych kluczy w domyślnych lokalizacjach
ru: Имя доверенного файла в месте по-умолчанию
uk: Ім’я довіреного ключу у місці за замовчуванням

# L_what_toverifyKey_do
source: Name of key to verify in default location
pl: Nazwa kluczy do weryfikacji w domyślnej lokalizacji
ru: Имя ключа для верификации в месте по-умолчанию
uk: Ім’я ключу для веріфікації у місці за замовчуванням

# L_what_trustedKeyFile_do
source: Name of trusted key file in specified location
pl: Nazwy zaufanych kluczy w określonej lokalizacji
ru: Имя доверенного файла ключа в указанном месте
uk: Ім’я довіреного файлу ключа у вказаному місці

# L_what_toverifyKeyFile_do
source: Name of key to verify file in specified location
pl: Nazwa kluczy do weryfikacji w określonej lokalizacji
ru: Имя ключа для верификации в указанном месте
uk: Ім’я ключу для веріфікації у вказаному місці

# L_what_toverifyDataFile_do
source: Name of data file specified location
pl: Nazwa plików z danymi w określonej lokalizacji
ru: Имя файла данных в указанном месте
uk: Ім’я файлу даних у вказаному місці
