Repository: yedino/galaxy42
Catalog: src-misc/locale/galaxy42_main/*.po
Languages: pl, ru, uk

# L_what_httpDbgPort_do
source: Set http debugger port
pl: Ustaw port http debuggera
ru: тоже что и --help
uk: так само, як --help

# L_starting_httpdbg_server
source: Starting http debugger server
pl: Uruchanianie serwera http debugger

# L_starting_main_server
source: Starting the TUN router
pl: Uruchamiamy urządzenie TUN (wirtualna karta sieciowa)
ru: Запускаем TUN маршрутизатор
uk: Стартуємо TUN роутер

# L_main_server_ended
source: Main server ended
pl: Główny server zakończył pracę

# L_httpdbg_server_ended
source: Http debugger server ended
pl: Http debugg server zakończył pracę

# L_what_exception_program_throw
source: Going to throw exception. What:
pl: Rzuci wyjątek. Jaki:
ru: Собираемся бросить исключение. Причина:
uk: Збіраємося кинути виключення. Підстава:

# L_max_number_of_tested_cards_limit_reached
source: Max number of tested cards reached
pl: Osiągnięto maksymalną liczbę sprawdzanych kart

# L_connection_to_tun_timeout
source: Connection to tun timeout
pl: Przekroczo czas próby połączenia z kartą

# L_searching_for_virtual_card
source: Searching for available virtual (tun) card
pl: Szukanie wirtualnej (tun) karty

# L_found_virtual_card_at_slot
source: Found virtual (tun) card at slot:
pl: Znaleziono virtualną kartę (tun) na slocie:

# L_get_home_directory:
source: Get home directory:
pl: Pobrano ścieżkę katalogu domowego:

# L_what_netHelloInterval_do
source: Set interval in seconds between pings
pl: Ustawia interwał w sekundach między pingami

# L_what_home-env_option_do
source: Set home directory path from HOME env. Works only on Linux
pl: Program pobiera scieżkę do katalogu home ze zmiennej środowiskowej HOME. Działa tylko na Linuksie.

# L_options_insecure-ADVANCED
source: Special options only for developers! Should NOT be used by normal users!
pl: Specjalne opcje tylko dla deweloperów, niebezpieczne! Nie powinny być używane przez zwykłego użytkownika!

# L_option_now_size
source: ' - now size:
ru: ' - нынешний размер:
uk: ' - розмір:
